pureDEM/test2/STL/inclineAngle-30deg/polyhedron_20-sided/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.25  0   -0.04)
    (0.75   0   -0.04) 
    (0.75   0.04 -0.04) 
    (-0.25  0.04 -0.04) 
    (-0.25  0    0.04)
    (0.75   0    0.04)
    (0.75   0.04  0.04) 
    (-0.25  0.04  0.04) 

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1000 40 80) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
			(0 4 7 3)	
            (2 6 5 1)
            (0 3 2 1)
            (4 5 6 7)       
        );
    }
    outlet
    {
        type patch;
        faces
        (
          (1 5 4 0)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
